{
  "items": [
    {
      "counter": false,
      "title": "Ayat Kursi",
      "ayat": "اللَّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ، لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ، لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ، مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ، يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ، وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ، وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ، وَلَا يَئُودُهُ حِفْظُهُمَا، وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "qty": "1 x",
      "arti": "“Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.” (QS. Al Baqarah: 255)",
      "benefit": "Whoever recites it in the evening, he will be protected (by Allah from various harms) until the morning. Whoever recites it in the morning, he will be protected until the evening.",
      "riwayat": "See Mustadrak Al-Hakim 1/562, Shahiih at-Targhiib wat Tarhiib 1/418 no. 662, authentic"
    },{
      "counter": false,
      "title": "Surah Al Ikhlas",
      "ayat": "قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
      "qty": "3 x",
      "arti": "“In the name of Allah, the Most Gracious, the Most Merciful. Say, 'He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.'” (QS. Al Ikhlas: 1-4)",
      "benefit": "Whoever recites them, each three times, in the morning and in the evening, they will suffice him for everything.",
      "riwayat": "HR. Abu Dawud no. 5082, Shahiih Abu Dawud no. 4241, Annasa-i VIII 250 and At-Tirmizi no. 3575 , At-Tarmidzi said, 'This hadith is hasan sahih' Ahmad V/312, from Abdullah bin Khubaib radhiyallahu 'anhu. Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649, hasan sahih"
    },{
      "counter": false,
      "title": "Surah Al Falaq",
      "ayat": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ * وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      "qty": "3 x",
      "arti": "“In the name of Allah, the Most Gracious, the Most Merciful. Say, 'I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.'” (QS. Al Falaq: 1-5)",
      "benefit": "Whoever recites them, each three times, in the morning and in the evening, they will suffice him for everything.",
      "riwayat": " HR. Abu Dawud no. 5082, Shahiih Abu Dawud no. 4241, Annasa-i VIII 250 and At-Tirmizi no. 3575 , At-Tarmidzi said, 'This hadith is hasan sahih' Ahmad V/312, from Abdullah bin Khubaib radhiyallahu 'anhu. Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649, hasan sahih"
    },{
      "counter": false,
      "title": "Surah An Naas",
      "ayat": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَ النَّاسِ",
      "qty": "3 x",
      "arti": "“In the name of Allah, the Most Gracious, the Most Merciful. Say, 'I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer, who whispers into the chests of mankind, from among the jinn and mankind.'” (QS. An Naas: 1-6)",
      "benefit": "Whoever recites them, each three times, in the morning and in the evening, they will suffice him for everything.",
      "riwayat": " HR. Abu Dawud no. 5082, Shahiih Abu Dawud no. 4241, Annasa-i VIII 250 and At-Tirmizi no. 3575 , At-Tarmidzi said, 'This hadith is hasan sahih' Ahmad V/312, from Abdullah bin Khubaib radhiyallahu 'anhu. Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649, hasan sahih"
    },{
      "counter": false,
      "title": "Sayyidul Istighfar",
      "ayat": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ",
      "qty": "1 x",
      "arti": "“O Allah, You are my Lord, there is no deity worthy of worship except You. You created me and I am Your slave, and I am abiding by Your covenant and promise as much as I can. I seek refuge in You from the evil I have committed. I acknowledge Your blessings upon me, and I acknowledge my sins, so forgive me, for none forgives sins except You.”",
      "benefit": "Whoever recites it with certainty in the morning and dies before evening, he will be among the people of Paradise. And whoever recites it with certainty in the evening and dies before morning, he will be among the people of Paradise.",
      "riwayat": "HR. Al-Bukhari no. 6306, 6323, Ahmad IV/122-125, an-Nasa-i VIII/279-280"
    },{
      "counter": false,
      "title": "-",
      "ayat": "اَللَّهُمَّ عَافِنِيْ فِيْ بَدَنِيْ، اَللَّهُمَّ عَافِنِيْ فِيْ سَمْعِيْ، اَللَّهُمَّ عَافِنِيْ فِيْ بَصَرِيْ، لاَ إِلَـهَ إِلاَّ أَنْتَ. اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، وَأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لاَ إِلَـهَ إِلاَّ أَنْتَ",
      "qty": "3 x",
      "arti": "“O Allah, grant me health in my body. O Allah, grant me health in my hearing. O Allah, grant me health in my sight. There is no deity worthy of worship except You. O Allah, I seek refuge in You from disbelief and poverty, and I seek refuge in You from the torment of the grave. There is no deity worthy of worship except You.”",
      "benefit": "-",
      "riwayat": "HR. Al-Bukhari in Shahiib al-Adabil Mufrad no. 701, Abu Dawud no. 5090, Ahmad V/42, hasan. See Shahiih Al-Adabil Mufrad no. 539"
    },{
      "counter": false,
      "title": "-",
      "ayat": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ وَسُوْءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
      "qty": "1 x",
      "arti": "“We have entered the morning and the dominion belongs to Allah, and all praise is for Allah. There is no deity worthy of worship except Allah, alone without any partners. To Him belongs the dominion and to Him belongs all praise, and He is over all things all-powerful. My Lord, I ask You for the good of this day and the good of what comes after it, and I seek refuge in You from the evil of this day and the evil of what comes after it. My Lord, I seek refuge in You from laziness and the evil of old age. My Lord, I seek refuge in You from the torment of the Fire and the torment of the grave.”",
      "benefit": "Asking Allah for the good of this day and the good that comes after it, as well as seeking protection from the evil of this day and the evil that comes after it. It also includes a plea for protection from laziness despite the ability to act, and from the evil of old age. It also contains a plea to be saved from the torment of the grave and the torment of the Fire, which is the most severe torment on the Day of Resurrection.",
      "riwayat": "HR. Muslim no. 2723 (75), Abu Dawud no. 5071, and at-Tirmidzi 3390, sahih"
    },{
      "counter": false,
      "title": "-",
      "ayat": "اَللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ وَإِلَيْكَ النُّشُوْرُ",
      "qty": "1 x",
      "arti": "“O Allah, by You we enter the morning, and by You we enter the evening. By You we live and by You we die, and to You is the resurrection.”",
      "benefit": "-",
      "riwayat": "HR. Al-Bukhari in al-Adabul Mufrad no. 1199, this wording is from al-Bukhari, at-Tirmidzi no. 3391, Abu Dawud no. 5068, Ahmad 11/354, Ibn Majah no. 3868, From Abu Hurairah Radhiyallahu 'anhu. Shahiih al-Adabil Mufrad no. 911, sahih. See also Silsilah al-Ahaadiits ash-Shahiihah no. 262."
    },{
      "counter": false,
      "title": "-",
      "ayat": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَاْلآخِرَةِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِى وَآمِنْ رَوْعَاتِى. اَللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِيْ، وَعَنْ يَمِيْنِيْ وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ",
      "qty": "1 x",
      "arti": "“O Allah, I ask You for pardon and well-being in this world and the Hereafter. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family, and my wealth. O Allah, conceal my flaws and calm my fears. O Allah, protect me from what is in front of me, from behind me, from my right, from my left, and from above me. I seek refuge in Your greatness from being assassinated from below me.”",
      "benefit": "The Messenger of Allah, peace be upon him, never abandoned this supplication in the morning and evening. It includes protection and safety for one's religion, worldly affairs, family, and wealth from various harms that come from all directions.",
      "riwayat": "HR. Al-Bukhari in al-Adabul Mufrad no. 1200, Abu Dawud no. 5074, An-Nasa-i VIII / 282, Ibn Majah no. 3871, al-Hakim 1/517-518, and others from Ibn Umar radhiyallahu 'anhumaa. See Shahiih al-Adabil Mufrad no. 912, sahih"
      },{
      "counter": false,
      "title": "-",
      "ayat": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
      "qty": "1 x",
      "arti": "“O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of all things, I bear witness that there is no deity worthy of worship except You. I seek refuge in You from the evil of my own self, and from the evil of Satan and his polytheism, and from committing any evil against myself or bringing it upon a Muslim.”",
      "benefit": "“O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of all things, I bear witness that there is no deity worthy of worship except You. I seek refuge in You from the evil of my own self, and from the evil of Satan and his polytheism, and from committing any evil against myself or bringing it upon a Muslim.”",
      "riwayat": "HR. Al-Bukhari in Al-Adabul Mufrad 1202, at-Tirmidzi no.3392 and Abu Daud no. 5067, See Shahih At- Tirmidzi no. 2798, Shahiih al-Adabil Mufrad no. 914, sahih. See Silsilah al-Ahaadiits ash-Shahiihah no. 2753"
    },{
      "counter": false,
      "title": "-",
      "ayat": "بِسْمِ اللَّهِ الَّذِى لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِى الأَرْضِ وَلاَ فِى السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "qty": "3 x",
      "arti": "“In the name of Allah, with Whose Name nothing is harmful on the earth nor in the heavens, and He is the All-Hearing, the All-Knowing.”",
      "benefit": "Whoever says this supplication three times in the morning and three times in the evening, no sudden harm will befall him.",
      "riwayat": "HR. At-Tirmidzi no. 3388, Abu Dawud no. 5088, Ibn Majah no. 3869, al-Hakim 1/514, and Ahmad no. 446 and 474, Tahqiq Ahmad Syakir. From 'Uthman bin 'Affan radhiyallahu 'anhu, see Shahiih Ibni Majah no. 3120, al-Hakim 1/513, Shahiih al-Adabil Mufrad no. 513, Shahiih at-Targhiib wat Tarhiib 1/413 no. 655, its chain of narration is sahih"
      },{
      "counter": false,
      "title": "-",
      "ayat": "رَضِيْتُ بِاللهِ رَبًّا، وَبِاْلإِسْلاَمِ دِيْنًا، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
      "qty": "3 x",
      "arti": "“I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad, peace be upon him, as a prophet.”",
      "benefit": "Whoever says this supplication three times in the morning and three times in the evening, it is befitting for him to receive the pleasure of Allah.",
      "riwayat": "HR. Ahmad IV/337, Abu Dawud no. 5072, at-Tirmidzi no. 3389, Ibn Majah no. 3870, an-Nasa-i in 'Amalul Yaum wal Lailah no. 4 and Ibnus Sunni no. 68, authenticated by Imam al-Hakim in al-Mustadrak 1/518 and agreed upon by Imam adz-Dzahabi, hasan. See Shahiih At Targhiib wat Tarhiib I/415 no. 657, Shahiih At Targhiib wat Tarhiib al-Waabilish Shayyib p. 170, Zaadul Ma’aad II/372, Silsilah al-Ahaadiits ash-Shahiihah no. 2686."
    },{
      "counter": false,
      "title": "-",
      "ayat": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، وَأَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ أَبَدًا",
      "qty": "1 x",
      "arti": "“O Ever-Living, O Sustainer of all existence, by Your mercy I seek help. Rectify all my affairs for me and do not entrust me to my own soul for a blink of an eye, ever.”",
      "benefit": "This supplication was taught by the Prophet, peace be upon him, to Fatimah to be recited in the morning and evening.",
      "riwayat": "Silsilah Ahaadits Ash Shohihah no. 227]"
    },{
      "counter": false,
      "title": "-",
      "ayat": "أَصْبَحْنَا عَلَى فِطْرَةِ اْلإِسْلاَمِ وَعَلَى كَلِمَةِ اْلإِخْلاَصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ، حَنِيْفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
      "qty": "1 x",
      "arti": "“In the morning, we hold to the natural disposition of Islam, the word of sincerity (the word of monotheism), the religion of our Prophet Muhammad, peace be upon him, and the way of our father Ibrahim, who was upright, a Muslim, and not one of the polytheists.”",
      "benefit": "-",
      "riwayat": "HR. Ahmad III/406, 407, ad-Darimi II/292 and Ibnus Sunni in Amalul Yaum wol Lailah no. 34, Misykaatul Mashaabiih no. 2415, Shahiihal-Jaami’ish Shaghiir no. 4674, sahih"
    },{
      "counter": true,
      "timer": 4800,
      "title": "-",
      "ayat": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
      "qty": "100 / 10 x",
      "arti": "“There is no deity worthy of worship except Allah, alone without any partners. To Him belongs the dominion and to Him belongs all praise, and He is over all things all-powerful.”",
      "benefit": "Whoever recites this dhikr in a day, 100 times, it is like freeing 100 slaves, 100 good deeds are written for him, 100 sins are erased from him, he will be protected from the evil of Satan from morning until evening, and no one will be better than him except for a person who does more than that.",
      "riwayat": "(100 x) HR. Al-Bukhari no. 3293 and 6403, Muslim IV/2071 no. 2691 (28), at-Tirmidzi no. 3468, Ibn Majah no. 3798, from the Companion Abu Hurairah, may Allah be pleased with him. | (10 x) HR. Muslim no. 2693, Ahmad V/420, Silsilah al-Ahaadiits ash-Shahiihah no. 113 and 114, Shahiih at-Targhiib wat Tarhiib 1/416 no. 660, sahih"
    },{
      "counter": false,
      "title": "-",
      "ayat": "سُبْحَانَ اللهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
      "qty": "3 x",
      "arti": "“Glory be to Allah and His praise: as many as His creatures, as much as His pleasure, as heavy as His Throne, and as much as the ink of His words.”",
      "benefit": "The Prophet, peace be upon him, told Juwairiyah that the dhikr above outweighed the dhikr Juwairiyah had been reciting from dawn until mid-morning.",
      "riwayat": "HR Muslim no. 2776"
    },{
      "counter": false,
      "title": "-",
      "ayat": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً",
      "qty": "1x after the greeting of the Fajr prayer",
      "arti": "“O Allah, I ask You for beneficial knowledge, a good provision, and an accepted deed.”",
      "benefit": "-",
      "riwayat": "HR. Ibn Majah no. 925. Sahih"
    },{
      "counter": true,
      "timer": 1500,
      "title": "-",
      "ayat": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
      "qty": "100 x in a day",
      "arti": "“Glory be to Allah and with His praise.”",
      "benefit": "Whoever says the phrase 'Subhanallah wa bi hamdih' 100 times in the morning and evening, no one will come on the Day of Judgment with anything better than what he has done, except for a person who has said something similar or more than that.",
      "riwayat": "HR. Muslim no. 2692"
      },{
      "counter": true,
      "timer": 1300,
      "title": "-",
      "ayat": "أَسْتَغْفِرُ اللهَ وَأَتُوْبُ إِلَيْهِ",
      "qty": "100 x in a day",
      "arti": "“I seek forgiveness from Allah and I repent to Him.”",
      "benefit": "-",
      "riwayat": "HR. Bukhari no. 6307 and Muslim no. 2702"
    }
  ]
}
